cask_args appdir: '/Applications'

# DB
#brew "postgresql"
#brew "postgis"
#brew "pgvector"
#brew "pgcli"



brew 'grep'
brew 'openssh'
brew 'screen'
brew 'zsh'
brew 'zplug'
brew 'git'
brew 'git-lfs'
brew 'node'           # Node.js runtime
brew 'pnpm'           # Fast, disk space efficient package manager
brew 'nvm'
brew 'vim'
brew 'the_silver_searcher'
brew 'powerlevel10k'

# Modern CLI alternatives
brew 'bat'           # Better cat with syntax highlighting
brew 'fd'            # Better find
brew 'ripgrep'       # Better grep
brew 'eza'           # Better ls (replaces exa)
brew 'zoxide'        # Better cd with frequency tracking
brew 'fzf'           # Fuzzy finder
brew 'htop'          # Better top
brew 'tree'          # Directory tree viewer
brew 'jq'            # JSON processor
brew 'delta'         # Better git diff
brew 'tmux'          # Terminal multiplexer
brew 'diff-so-fancy' # Better git diff (referenced in .gitconfig)
brew 'tldr'          # Simplified man pages
brew 'watch'         # Execute commands periodically
cask 'font-meslo-lg-nerd-font'
brew 'gh'
brew 'curl'
brew 'syncthing'

# Network and system tools
brew 'wget'            # HTTP/FTP file downloader
brew 'nmap'            # Network mapper/port scanner
brew 'netcat'          # Network utility for reading/writing network connections
# brew 'telnet'        # Provided by inetutils to avoid conflicts
brew 'whois'           # Domain registration lookup
brew 'bind'            # DNS utilities including dig, nslookup
brew 'inetutils'       # Network utilities including netstat, ping
brew 'mtr'             # Network diagnostic tool (traceroute + ping)
brew 'iperf3'          # Network bandwidth measurement
brew 'tcpdump'         # Packet analyzer
brew 'wireshark'       # Network protocol analyzer (GUI)
brew 'ngrep'           # Network grep
brew 'openjdk'
brew 'azure-cli'
brew 'act'
brew 'terraform'
brew 'tflint'
brew 'terraform-docs'
brew 'checkov'
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'uv'
brew 'just'
brew 'awscli'           # AWS Command Line Interface

cask 'iterm2'
cask 'ghostty'            # Fast, native terminal emulator
cask 'visual-studio-code'
cask 'windsurf'         # AI-powered code editor
cask 'slack'
cask 'spotify'
cask 'brave-browser'      # Privacy-focused web browser
#cask 'microsoft-edge'
cask 'rectangle'         # Window management tool
cask 'docker-desktop'
cask '1password'          # Password manager
cask '1password-cli'     # 1Password command-line tool
cask 'grammarly-desktop'  # Grammar and spell checker
# cask 'xcode'            # Install from Mac App Store instead
cask 'obsidian'           # Note-taking and knowledge management
cask 'todoist'            # Task management and productivity
cask 'anki'               # Spaced repetition flashcard system
# cask 'nordvpn'          # VPN client - moved to manual-installs.md
cask 'alfred'             # Application launcher and productivity tool
cask 'flux'               # Blue light filter for better sleep
# cask 'displaylink'      # Deprecated, install manually if needed

# Dev Container tools
brew 'devcontainer'    # Dev Container CLI

# Manual installations required - see manual-installs.md for complete list:
# - Xcode: Install from Mac App Store
# - DisplayLink: Driver deprecated in Homebrew, install manually if needed
# - Cloud Desktop: Enterprise-specific application
# 
# Note: Claude Code CLI installed via npm in post-install step
