cask_args appdir: '/Applications'

tap 'homebrew/cask-fonts'

brew 'grep'
brew 'openssh'
brew 'screen'
brew 'zsh'
brew 'zplug'
brew 'git'
brew 'git-lfs'
brew 'yarn'
brew 'nvm'
brew 'vim'
brew 'the_silver_searcher'
brew 'powerlevel10k'
cask 'font-meslo-lg-nerd-font'
brew 'gh'
brew 'curl'
brew 'syncthing'
brew 'openjdk'
brew 'azure-cli'
brew 'act'
brew 'terraform'
brew 'tflint'
brew 'terraform-docs'
brew 'checkov'

cask 'sequel-pro'
cask 'iterm2'
cask 'visual-studio-code'
cask 'slack'
cask 'spotify'
cask 'microsoft-edge'
cask 'rectangle'
cask 'docker'
