cask_args appdir: '/Applications'

# DB
brew "postgresql"
brew "postgis"
brew "pgvector"
brew "pgcli"


tap 'homebrew/cask-fonts'

brew 'grep'
brew 'openssh'
brew 'screen'
brew 'zsh'
brew 'zplug'
brew 'git'
brew 'git-lfs'
brew 'yarn'
brew 'nvm'
brew 'vim'
brew 'the_silver_searcher'
brew 'powerlevel10k'

# Modern CLI alternatives
brew 'bat'           # Better cat with syntax highlighting
brew 'fd'            # Better find
brew 'ripgrep'       # Better grep
brew 'eza'           # Better ls (replaces exa)
brew 'zoxide'        # Better cd with frequency tracking
brew 'fzf'           # Fuzzy finder
brew 'htop'          # Better top
brew 'tree'          # Directory tree viewer
brew 'jq'            # JSON processor
brew 'delta'         # Better git diff
brew 'tmux'          # Terminal multiplexer
brew 'diff-so-fancy' # Better git diff (referenced in .gitconfig)
brew 'tldr'          # Simplified man pages
brew 'watch'         # Execute commands periodically
cask 'font-meslo-lg-nerd-font'
brew 'gh'
brew 'curl'
brew 'syncthing'
brew 'openjdk'
brew 'azure-cli'
brew 'act'
brew 'terraform'
brew 'tflint'
brew 'terraform-docs'
brew 'checkov'
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'uv'
brew 'just'

cask 'sequel-pro'
cask 'iterm2'
cask 'visual-studio-code'
cask 'slack'
cask 'spotify'
cask 'microsoft-edge'
cask 'rectangle'
cask 'docker'
